//아스키 아트를 이용한 자신의 이니셜, 사진 출력
#include <stdio.h>

void printAsciiart_word()
{
    printf("    _   ____  _______ \n");      //아스키아트를 이용한 자신의 이니셜 출력
    printf("   / | / / / / / ___/ \n");      //아스키아트를 이용한 자신의 이니셜 출력
    printf("  /  |/ / /_/ /\\__ \\  \n");    //아스키아트를 이용한 자신의 이니셜 출력, 이스케이프 시퀀트로 인한 \ 추가
    printf(" / /|  / __  /___/ /  \n");      //아스키아트를 이용한 자신의 이니셜 출력
    printf("/_/ |_/_/ /_//____/   \n");      //아스키아트를 이용한 자신의 이니셜 출력
}
/*  아스키아트를 이용한 자신의 이니셜
    _   ____  _______
   / | / / / / / ___/
  /  |/ / /_/ /\__ \
 / /|  / __  /___/ /
/_/ |_/_/ /_//____/
                     */
void printAsciiart_picture()
{
    printf("..........       ..... ....... \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("~~~~~~~----,,,-------------~~~ \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("---~~----,,,,,,,,,,,-------~~~ \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("-------,,,-:=$=#$:-,,,,,,--~~~ \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("-----,,,,;=$$####@#!:,,,,---~~ \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("------,,-==$$####@#@#!,,------ \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("------,,=#$###$#####@@:,------ \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("---,,,,,#$$=$$$$$$$##@@,,----- \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("--,,,,,!#=======$$$##@@-,,---- \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("--,,,,,=$=$$===$$$###@@;,,,,,, \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("--,,,,,*##@#$==$$##@@@@!..,,,, \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("-,,,,,,~#$=**:,,~:;:=@$,...... \n");  //아스키아트를 이용한 자신의 사진 출력
    printf(",,,.....=;~!!;~:;**;*#~......, \n");  //아스키아트를 이용한 자신의 사진 출력
    printf(",...... ;~,,-:;=----!!~....... \n");  //아스키아트를 이용한 자신의 사진 출력
    printf(".....   .-.  :.~,  ,!:........ \n");  //아스키아트를 이용한 자신의 사진 출력
    printf(".       .~---~ .~--,-- ......, \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("         .---,,,---,,.......,, \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("         .,.   .. .,.    ...., \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("         ,,.,~--~,.,.    ..... \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("          -,......,,     ...., \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("          ;:-.  .,-:.    ...., \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("        ;=!~;~-,---=#;    ..., \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("     ,!$$$;~-::--~!$###:,. ... \n");  //아스키아트를 이용한 자신의 사진 출력
    printf(" ,::;=$$$$=~-~::;**#####$;:,.. \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("*=$$$$$$$$$$*!;:!$$####$$$$=*- \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("$$$$$$$$$=$$#$;-$$$$$$$$$$$$$$ \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("$$$$$$$$==$=$=*:$$$$$$$$$$$$$$ \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("$$$$$$=====$==$$$$$$$=$$$=$==$ \n");  //아스키아트를 이용한 자신의 사진 출력
    printf("$$$$$$====$$==$$=$$====$$$==$$ \n");  //아스키아트를 이용한 자신의 사진 출력
}                                                 
/* 아스키아트를 이용한 자신의 사진                                                 
..........       ..... .......                    
~~~~~~~----,,,-------------~~~
---~~----,,,,,,,,,,,-------~~~
-------,,,-:=$=#$:-,,,,,,--~~~
-----,,,,;=$$####@#!:,,,,---~~
------,,-==$$####@#@#!,,------
------,,=#$###$#####@@:,------
---,,,,,#$$=$$$$$$$##@@,,-----
--,,,,,!#=======$$$##@@-,,----
--,,,,,=$=$$===$$$###@@;,,,,,,
--,,,,,*##@#$==$$##@@@@!..,,,,
-,,,,,,~#$=**:,,~:;:=@$,......
,,,.....=;~!!;~:;**;*#~......,
,...... ;~,,-:;=----!!~.......
.....   .-.  :.~,  ,!:........
.       .~---~ .~--,-- ......,
         .---,,,---,,.......,,
         .,.   .. .,.    ....,
         ,,.,~--~,.,.    .....
          -,......,,     ....,
          ;:-.  .,-:.    ....,
        ;=!~;~-,---=#;    ...,
     ,!$$$;~-::--~!$###:,. ...
 ,::;=$$$$=~-~::;**#####$;:,..
*=$$$$$$$$$$*!;:!$$####$$$$=*-
$$$$$$$$$=$$#$;-$$$$$$$$$$$$$$
$$$$$$$$==$=$=*:$$$$$$$$$$$$$$
$$$$$$=====$==$$$$$$$=$$$=$==$
$$$$$$====$$==$$=$$====$$$==$$
*/
void main()
{
    printAsciiart_word();      //아스키아트를 이용하여 이니셜을 출력하는 함수
    printAsciiart_picture();   //아스키아트를 이용하여 사진을 출력하는 함수
}
